Revit 2024 API
Frame.Origin Property
 The frame's base point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public XYZ Origin { get; set; }
Visual Basic
Public Property Origin As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Frame Class
Autodesk.Revit.DB Namespace